# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Пример:  6 -> 1  4  1                24 -> 4  16  4                60 -> 10  40  10
number = int(input('Введите S журавликов: '))
if number % 6 == 0:
    print(f'Сережа и Петя сделали по {number/6} журавликов,')
    print(f'а Катя умничка, сделала {number/6*4} журавликов')
else: print('Не корректное число журавликов')